tests/Functional/Resources/Products/_fixtures/response/full_entity_with_includes.json

{
  "data": {
    "id": "pro_01h7zcgmdc6tmwtjehp3sh7azf",
    "name": "ChatApp Full",
    "tax_category": "standard",
    "description": "Spend more time engaging with students with ChataApp Education. Includes features from our Pro plan, plus tools to help educators track student progress.",
    "image_url": "https://paddle-sandbox.s3.amazonaws.com/user/10889/2nmP8MQSret0aWeDemRw_icon1.png",
    "custom_data": {
      "features": {
        "crm": false,
        "data_retention": true,
        "reports": true
      }
    },
    "status": "active",
    "created_at": "2023-08-16T14:38:08.3Z",
    "updated_at": "2023-08-16T14:38:08.3Z",
    "prices": [
      {
        "id": "pri_01he5kxqey1k8ankgef29cj4bv",
        "product_id": "pro_01he5kwnnvgdv2chtpgavk2rf8",
        "description": "Base subscription",
        "name": "Base subscription",
        "billing_cycle": {
          "interval": "month",
          "frequency": 1
        },
        "trial_period": null,
        "tax_mode": "account_setting",
        "unit_price": {
          "amount": "10",
          "currency_code": "USD"
        },
        "unit_price_overrides": [],
        "custom_data": null,
        "status": "active",
        "quantity": {
          "minimum": 1,
          "maximum": 100
        },
        "created_at": "2023-08-16T14:38:08.3Z",
        "updated_at": "2023-08-16T14:38:08.3Z"
      }
    ]
  },
  "meta": {
    "request_id": "ed738012-b8b3-4b4a-8761-ca708a01e400"
  }
}
